README.md content updated
